# 二进制
print(bin(5))  # 101

"""
518    256    128    64    32    16    8    4    2    1
                                            1    0    1
"""


# 十六进制
print(hex(5))

# 根据 ASCII 码返回对应的字符
print(ord("a"))
print(chr(97))


# 位运算

"""
5 + 3 = 8
101 + 11 = 111

5 * 2 = 10
往左移动一位，结果为 1010

10 / 2 = 5
往右移动一位，结果为 101
"""


# & 运算（按位与运算符），当位都为 1 时，位的结果为 1,否则为 0
print(60 & 13)  # 12

"""
128    64    32    16    8    4    2    1
0      0     1     1     1    1    0    0   = 60
0      0     0     0     1    1    0    1   = 13
0      0     0     0     1    1    0    0   = 12
"""


# | 运算（按位或运算符），当位有一个是 1 时，位的结果为 1, 否则为 0
print(60 | 13)  # 61

"""
128    64    32    16    8    4    2    1
0      0     1     1     1    1    0    0   = 60
0      0     0     0     1    1    0    1   = 13
0      0     1     1     1    1    0    1   = 61
"""


# ^ 运算（按位异运算符），当位相异时，位的结果为 1,否则为 0
print(60 ^ 13)  # 49

"""
128    64    32    16    8    4    2    1
0      0     1     1     1    1    0    0   = 60
0      0     0     0     1    1    0    1   = 13
0      0     1     1     0    0    0    1   = 49
"""


# ~ 运算（按位取反运算符），当位为 1 时，位的结果为 0,否则为 1（快记：-(n+1)）
print(~13)  # -14


# << 运算（左移运算符）
print(5 << 1)  # 10

"""
128    64    32    16    8    4    2    1
0      0     0     0     0    1    0    1   = 5
0      0     0     0     1    0    1    0   = 10
"""


# >> 运算（右移运算符）
print(5 >> 1)  # 2

"""
128    64    32    16    8    4    2    1
0      0     0     0     0    1    0    1   = 5
0      0     0     0     0    0    1    0   = 2
"""
